"""Module on commits."""

# **Соглашение о коммитах**

# https://www.conventionalcommits.org/ru/v1.0.0/

# ![image.png](attachment:image.png)

# * feat - добавляет новую функцию
# * fix - исправляет баг
# * docs -  изменение в документации проекта
# * style - изменение оформления кода
# * refactor - изменение кода с целью улучшения его структуры или читаемости
# * test - добавление или изменение тестов
# * build - изменение системы сборки проекта или зависимостей
# * ci - (continuous integration) изменение в конфигурациях CI/CD (обновление скриптов автоматизации, настройка окружений...)
# * perf - (performance) улучшение производительности
# * chore - обновления зависимостей, изменения в конфигурации и другие рутинные задачи

# Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix).
