"""Commits."""

# 1. Опишите своими словами назначение каждого из этих типов коммитов:
# feat, fix, docs, style, refactor, test, build, ci, perf, chore.
#
# feat - добавление какой-либо важной функции в код
#
# fix - исправление багов, недочетов в коде.
#
# docs - дополнение документации.
#
# style - изменения в стиле кода, без изменения его структуры.
#
# refractor - изменения структуры кода.
#
# test - коммит, проводящийся в целях проверить работоспособность того или иного парта проекта
#
# build - изменения в сборке (setup) - добавление библиотек, линтеров и тд.
#
# ci - касаются конфигурации инструментов CI
#
# perf - оптимизация, улучшение производительности
#
# chore - выполнение мелкой задачи.

# **2. Представьте, что вы исправили баг в функции, которая некорректно округляет числа. Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix).**
#
# - done: https://github.com/SENATOROVAI/Data-Science-For-Beginners-from-scratch-SENATOROV/commit/e1f49686642a33cb319dd2b2260a08638edf6313
#
# **3. Добавление новой функциональности: Допустим, вы реализовали новую функцию generateReport в проекте. Сделайте фиктивный коммит с типом feat, отражающий добавление этой функциональности**
#
# - done: https://github.com/SENATOROVAI/Data-Science-For-Beginners-from-scratch-SENATOROV/commit/f29412139c18577d067805c209a7827eb34977bf
#
# **4. Модификация формата кода или стилей: Представьте, что вы поправили отступы и форматирование во всём проекте, не меняя логики кода. Сделайте фиктивный коммит с типом style**

#
